app/controllers/open_topics_controller.rb

SELECT "open_topics".* FROM "open_topics"
---
  def index
    @open_topics = OpenTopic.all

INSERT INTO "open_topics" ("shortlist", "number", "summary", "description", "option", "component", "category", "prio", "responsible", "state", "costmodel", "affects_version", "issue_ticket", "ticket_text", "notes", "in_sprint", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @open_topic = OpenTopic.new(open_topic_params)

    respond_to do |format|
      if @open_topic.save

DELETE FROM "open_topics" WHERE "open_topics"."id" = ?  [["id", 2]]
---
  def destroy
    @open_topic.destroy

SELECT  "open_topics".* FROM "open_topics" WHERE "open_topics"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_open_topic
      @open_topic = OpenTopic.find(params[:id])